Seeed-Studio/ai-skills/skills/xiao-adapter/output/seeed_xiao_samd21plus/boards.txt
###############################################
## Seeed XIAO SAMD21-Plus
###############################################

seeed_XIAO_samd21plus.name=Seeed XIAO SAMD21-Plus
seeed_XIAO_samd21plus.vid.0=0x2886
seeed_XIAO_samd21plus.pid.0=<USER_PROVIDED_PID>
seeed_XIAO_samd21plus.vid.1=0x2886
seeed_XIAO_samd21plus.pid.1=<USER_PROVIDED_PID_BOOTLOADER>
seeed_XIAO_samd21plus.upload.tool=bossac
seeed_XIAO_samd21plus.upload.protocol=sam-ba
seeed_XIAO_samd21plus.upload.maximum_size=262144
seeed_XIAO_samd21plus.upload.offset=0x2000
seeed_XIAO_samd21plus.upload.use_1200bps_touch=true
seeed_XIAO_samd21plus.upload.wait_for_upload_port=true
seeed_XIAO_samd21plus.upload.native_usb=true
seeed_XIAO_samd21plus.build.mcu=cortex-m0plus
seeed_XIAO_samd21plus.build.f_cpu=48000000L
seeed_XIAO_samd21plus.build.usb_product="Seeed XIAO SAMD21-Plus"
seeed_XIAO_samd21plus.build.usb_manufacturer="Seeed"
seeed_XIAO_samd21plus.build.board=SEEED_XIAO_SAMD21PLUS
seeed_XIAO_samd21plus.build.core=arduino
seeed_XIAO_samd21plus.build.extra_flags=-DARDUINO_SAMD_ZERO -D__SAMD21__ -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DSEEED_XIAO_SAMD21PLUS {build.usb_flags}
seeed_XIAO_samd21plus.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
seeed_XIAO_samd21plus.build.openocdscript=openocd_scripts/XIAO_m0.cfg
seeed_XIAO_samd21plus.build.variant=seeed_xiao_samd21plus
seeed_XIAO_samd21plus.build.variant_system_lib=
seeed_XIAO_samd21plus.build.vid=0x2886
seeed_XIAO_samd21plus.build.pid=<USER_PROVIDED_PID>
seeed_XIAO_samd21plus.bootloader.tool=openocd
seeed_XIAO_samd21plus.bootloader.file=XIAOM0/bootloader-XIAO_m0-v3.7.0-33-g90ff611-dirty.bin

# USB stack selection
seeed_XIAO_samd21plus.menu.usbstack.arduino=Arduino
seeed_XIAO_samd21plus.menu.usbstack.tinyusb=TinyUSB
seeed_XIAO_samd21plus.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Debug
seeed_XIAO_samd21plus.menu.debug.off=Off
seeed_XIAO_samd21plus.menu.debug.on=On
seeed_XIAO_samd21plus.menu.debug.on.build.flags.debug=-g -DDEBUG=1
